{
  "title": "Strumento di Dimensionamento Milvus",
  "content": "Uno strumento per stimare i requisiti di risorse e generare una configurazione per la tua implementazione di Milvus.",
  "tooltip": "<0>Nota</0>: la configurazione è la nostra migliore stima basata sull'esperienza, ma suggeriamo di testare con i tuoi dati e il modello di traffico prima di lanciare in produzione.",
  "form": {
    "num": "Numero di Vettori",
    "dim": "Dimensione del Vettore",
    "withScalar": "Con Campi Scalari",
    "averageLength": "Dimensione Media dei Dati per Riga",
    "offloading": "Scaricamento dei Campi su Disco",
    "mmp": "Milvus utilizza <0>Mmap</0> per consentire l'accesso diretto alla memoria per grandi file su disco senza leggere l'intero file in memoria.",
    "indexType": "Tipo di Indice",
    "indexTypeTip": "Come scegliere l'indice vettoriale?",
    "indexParam": "Parametri dell'Indice",
    "indexParamTip": "Come impostare i parametri dell'indice corretti? <0>scopri più dettagli</0>.",
    "withRawData": "with_raw_data",
    "m": "M(Grado massimo del nodo)",
    "nlist": "nlist",
    "maxDegree": "max_degree",
    "segmentSize": "Dimensione del Segmento",
    "dependencyComp": "Componente di Dipendenza",
    "mode": "Modalità",
    "modeTip": "Man mano che la dimensione dei tuoi dati cresce, puoi migrare i dati dalla modalità Standalone alla modalità Cluster. <0>Visualizza di più</0>.",
    "modeDisableTip": "Per grandi dimensioni di dati, è consigliabile utilizzare la distribuzione in modalità cluster per ottenere migliori prestazioni e scalabilità.",
    "pulsar": "Pulsar",
    "kafka": "Kafka",
    "standalone": "Standalone",
    "standaloneDesc": "Adatto per piccola e media scala.",
    "cluster": "Distribuito",
    "clusterDesc": "Adatto per grande scala.",
    "segmentTooltip": "datacoord.segment.maxSize è un importante parametro di configurazione della memorizzazione in Milvus. Definisce la dimensione di un singolo segmento, che è l'unità fisica di archiviazione di Milvus. L'aumento di questo valore può migliorare le prestazioni delle query, ma consuma anche più risorse. <0>Per saperne di più.</0>",
    "refine": "Raffinare",
    "refineType": "Raffinare il tipo"
  },
  "overview": {
    "title": "Requisiti di Risorse",
    "explore": "Esplora il Costo del Servizio Gestito",
    "overview": "Calcolo della Dimensione dei Dati",
    "raw": "Dimensione dei Dati Grezzi: ",
    "rawTooltip": "La dimensione dei dati originali che è determinata dal numero di vettori, dalla dimensione del vettore e dalla dimensione dei dati del campo scalare.",
    "memory": "Memoria di Caricamento: ",
    "memoryTooltip": "Consumo di memoria per i nodi di query che è determinato dalla dimensione dei dati grezzi, dal tipo di indice e dai parametri per i nodi di query."
  },
  "setup": {
    "title": "Imposta Requisiti di Risorse",
    "cloud": "Esplora il Costo del Servizio Gestito",
    "outOfRange": "Hai una grande quantità di dati. Per favore <0>contattaci</0> per esplorare le migliori pratiche per la distribuzione.",
    "milvus": {
      "title": "Milvus",
      "proxy": "Proxy",
      "mixCoord": "Mix Coord",
      "dataNode": "Nodo Dati",
      "indexNode": "Nodo Indice",
      "queryNode": "Nodo Query",
      "diskSize": "<0>Disco Locale</0>: <1>{{size}}</1>",
      "proxyTip": "Il proxy è il livello di accesso del sistema e l'endpoint per gli utenti. Suggerimento: Allocare più risorse per gestire un carico di lavoro QPS più elevato.",
      "mixCoordTip": "Mix coord è responsabile della pianificazione dei task di background del cluster, del mantenimento della topologia dei metadati, della gestione di DDL, DCL e dell'allocazione TSO.",
      "queryNodeTip": "Il nodo query è responsabile della query e della ricerca dei dati. Suggerimento: Allocare più risorse per gestire un carico di lavoro intenso in lettura.",
      "dataNodeTip": "Il nodo dati recupera i dati di log incrementali sottoscrivendo il broker di log, elabora le richieste di mutazione e impacchetta i dati di log in snapshot di log e li memorizza nello storage di oggetti. Suggerimento: Allocare più risorse per gestire un carico di lavoro intenso in scrittura.",
      "indexNodeTip": "Il nodo indice è responsabile della costruzione degli indici. La quantità di risorse può influenzare la velocità di costruzione dell'indice. È possibile aumentare o diminuire questa risorsa in base alle esigenze effettive.",
      "standaloneNode": "Nodo Standalone",
      "streamNode": "Nodo di flusso",
      "streamNodeTip": "Lo StreamingNode è responsabile della gestione di tutte le attività di streaming. Il numero di risorse influisce direttamente sul throughput e sulla latenza di Milvus per tutte le operazioni di streaming, tra cui la ricerca di dati in crescita, la scrittura di dati, la convenzione di dati da wal a binlog (dati in streaming a dati storici)."
    },
    "dependency": {
      "title": "Dipendenza",
      "etcd": "ETCD",
      "minio": "Minio",
      "pulsar": "Pulsar",
      "kafka": "Kafka",
      "bookie": "Bookie",
      "broker": "Broker",
      "proxy": "Proxy",
      "zookeeper": "Zookeeper",
      "etcdTip": "ETCD è utilizzato per memorizzare i metadati. Si prega di specificare una classe di storage ad alte prestazioni del disco per garantire prestazioni ottimali.",
      "apacheTip": "Si prega di specificare una classe di storage ad alte prestazioni del disco per Bookie.Journal e Zookeeper per garantire prestazioni ottimali.",
      "kafkaTip": "Si prega di specificare una classe di storage ad alte prestazioni del disco per Zookeeper per garantire prestazioni ottimali."
    },
    "basic": {
      "cpuAndMemory": "CPU e Memoria: <0>{{cpu}} {{memory}}</0>",
      "storageWithValue": "Storage: <0>{{size}}</0>",
      "diskWithValue": "Disco Locale: <0>{{disk}}</0>",
      "cpu": "CPU",
      "memory": "Memoria",
      "disk": "Disco Locale",
      "storage": "Storage",
      "podNum": "Numero di Pod",
      "pvc": "Pvc per Pod: <0>{{pvc}}</0>",
      "pvcLabel": "Pvc per Pod",
      "journal": "Journal",
      "ledger": "Ledgers",
      "config": "{{cpu}} Core {{memory}} GB",
      "core": "{{cpu}} Core",
      "simpleCore": "{{cpu}} C",
      "gb": "{{memory}} GB",
      "byte": "Bytes"
    }
  },
  "install": {
    "title": "Installa Milvus",
    "helm": "Helm Chart",
    "operator": "Milvus Operator",
    "docker": "Docker Compose",
    "adv": "Troppe risorse consumate? Prova Zilliz Cloud (Milvus gestito) per risparmiare risorse e ridurre i costi di distribuzione e operazione. Scopri più dettagli con il calcolatore Zilliz Cloud. <0>Vai al calcolatore Zilliz Cloud</0>.",
    "adv2": "Configurazione di un cluster Milvus per test delle prestazioni o benchmarking? Fai riferimento a <0>VDB Bench</0> per una guida dettagliata.",
    "tip1": "Come eseguire Milvus con Docker Compose?",
    "tip2": "Come eseguire Milvus con Helm Chart?",
    "tip3": "Come eseguire Milvus con Milvus Operator?"
  },
  "woodpeckerTip": "<0>Woodpecker</0> è un sistema di log write-ahead (WAL) cloud-native a partire da Milvus 2.6.0. È stato progettato per sostituire Kafka e Pulsar come MQ in Milvus per semplificare le operazioni, massimizzare il throughput e scalare senza sforzo. Per ora è integrato nei nodi di streaming.",
  "previousVersion": "La versione precedente dello strumento di dimensionamento è <0>qui</0>."
}
