{
  "title": "Alat Ukuran Milvus",
  "content": "Alat untuk memperkirakan kebutuhan sumber daya dan menghasilkan konfigurasi untuk deployment Milvus Anda.",
  "tooltip": "<0>Catatan</0>: konfigurasi ini adalah perkiraan terbaik kami berdasarkan pengalaman, tetapi kami sarankan untuk menguji dengan pola data dan lalu lintas Anda sebelum meluncurkan ke produksi.",
  "form": {
    "num": "Jumlah Vektor",
    "dim": "Dimensi Vektor",
    "withScalar": "Dengan Bidang Scalar",
    "averageLength": "Ukuran Data Rata-rata Per Baris",
    "offloading": "Penguraian Bidang ke Disk",
    "mmp": "Milvus menggunakan <0>Mmap</0> untuk memungkinkan akses memori langsung ke file besar di disk tanpa membaca seluruh file ke memori.",
    "indexType": "Jenis Indeks",
    "indexTypeTip": "Bagaimana memilih indeks vektor?",
    "indexParam": "Parameter Indeks",
    "indexParamTip": "Bagaimana menetapkan parameter indeks yang tepat? <0>pelajari lebih banyak detail</0>.",
    "withRawData": "dengan_data_mentah",
    "m": "M(Derajat maksimum dari node)",
    "nlist": "nlist",
    "maxDegree": "max_degree",
    "segmentSize": "Ukuran Segmen",
    "dependencyComp": "Komponen Ketergantungan",
    "mode": "Mode",
    "modeTip": "Ketika ukuran data Anda bertambah, Anda dapat memigrasikan data dari mode Standalone ke mode Cluster. <0>Lihat Lebih Banyak</0>.",
    "modeDisableTip": "Untuk ukuran data yang besar, disarankan menggunakan deployment mode cluster untuk mencapai kinerja dan skalabilitas yang lebih baik.",
    "pulsar": "Pulsar",
    "kafka": "Kafka",
    "standalone": "Standalone",
    "standaloneDesc": "Cocok untuk skala kecil hingga menengah.",
    "cluster": "Terdistribusi",
    "clusterDesc": "Cocok untuk skala besar.",
    "segmentTooltip": "datacoord.segment.maxSize adalah parameter konfigurasi penyimpanan yang penting dalam Milvus. Parameter ini mendefinisikan ukuran satu segmen, yang merupakan unit penyimpanan fisik di Milvus. Meningkatkan nilai ini dapat meningkatkan kinerja kueri, tetapi juga akan menghabiskan lebih banyak sumber daya. <0>Lihat Lebih Lanjut.</0>"
  },
  "overview": {
    "title": "Kebutuhan Sumber Daya",
    "explore": "Jelajahi Biaya Layanan Terkelola",
    "overview": "Perhitungan Ukuran Data",
    "raw": "Ukuran Data Mentah: ",
    "rawTooltip": "Ukuran data asli yang ditentukan oleh jumlah vektor, dimensi vektor, dan ukuran data bidang scalar.",
    "memory": "Memuat Memori: ",
    "memoryTooltip": "Konsumsi memori untuk node kueri yang ditentukan oleh ukuran data mentah, jenis indeks, dan parameter untuk node kueri."
  },
  "setup": {
    "title": "Atur Kebutuhan Sumber Daya",
    "cloud": "Jelajahi Biaya Layanan Terkelola",
    "outOfRange": "Anda memiliki jumlah data yang besar. Silakan <0>hubungi kami</0> untuk menjelajahi praktik terbaik untuk deployment.",
    "milvus": {
      "title": "Milvus",
      "proxy": "Proxy",
      "mixCoord": "Koordinasi Campuran",
      "dataNode": "Node Data",
      "indexNode": "Node Indeks",
      "queryNode": "Node Kueri",
      "diskSize": "<0>Disk Lokal</0>: <1>{{size}}</1>",
      "proxyTip": "Proxy adalah lapisan akses sistem dan titik akhir untuk pengguna. Tips: Alokasikan lebih banyak sumber daya untuk menangani beban kerja QPS yang lebih tinggi.",
      "mixCoordTip": "Koordinasi campuran bertanggung jawab untuk menjadwalkan tugas latar belakang kluster, memelihara topologi metadata, menangani DDL, DCL, dan alokasi TSO.",
      "queryNodeTip": "Node kueri bertanggung jawab atas kueri data dan pencarian. Tips: Alokasikan lebih banyak sumber daya untuk menangani beban kerja baca yang berat.",
      "dataNodeTip": "Node data mengambil data log incremental dengan berlangganan ke broker log, memproses permintaan mutasi, dan memasukkan data log ke snapshot log dan menyimpannya di penyimpanan objek. Tips: Alokasikan lebih banyak sumber daya untuk menangani beban kerja tulis yang berat.",
      "indexNodeTip": "Node indeks bertanggung jawab atas pembangunan indeks. Jumlah sumber daya dapat mempengaruhi kecepatan pembangunan indeks. Anda dapat meningkatkan atau mengurangi sumber daya ini sesuai dengan kebutuhan aktual.",
      "standaloneNode": "Node Standalone",
      "streamNode": "Stream Node",
      "streamNodeTip": "StreamingNode bertanggung jawab untuk menangani semua tugas streaming. Jumlah sumber daya secara langsung memengaruhi throughput dan latensi Milvus untuk semua operasi streaming, termasuk pencarian data yang terus bertambah, penulisan data, konvensi data dari wal ke binlog (streaming data ke data historis)."
    },
    "dependency": {
      "title": "Ketergantungan",
      "etcd": "ETCD",
      "minio": "Minio",
      "pulsar": "Pulsar",
      "kafka": "Kafka",
      "bookie": "Bookie",
      "broker": "Broker",
      "proxy": "Proxy",
      "zookeeper": "Zookeeper",
      "etcdTip": "ETCD digunakan untuk menyimpan metadata. Harap tentukan kelas penyimpanan kinerja disk tinggi untuk memastikan kinerja optimal.",
      "apacheTip": "Harap tentukan kelas penyimpanan kinerja disk tinggi untuk Bookie.Journal dan Zookeeper untuk memastikan kinerja optimal.",
      "kafkaTip": "Harap tentukan kelas penyimpanan kinerja disk tinggi untuk Zookeeper untuk memastikan kinerja optimal."
    },
    "basic": {
      "cpuAndMemory": "CPU dan Memori: <0>{{cpu}} {{memory}}</0>",
      "storageWithValue": "Penyimpanan: <0>{{size}}</0>",
      "diskWithValue": "Disk Lokal: <0>{{disk}}</0>",
      "cpu": "CPU",
      "memory": "Memori",
      "disk": "Disk Lokal",
      "storage": "Penyimpanan",
      "podNum": "Jumlah Pod",
      "pvc": "Pvc per Pod: <0>{{pvc}}</0>",
      "pvcLabel": "Pvc per Pod",
      "journal": "Jurnal",
      "ledger": "Buku Besar",
      "config": "{{cpu}} Core {{memory}} GB",
      "core": "{{cpu}} Core",
      "simpleCore": "{{cpu}} C",
      "gb": "{{memory}} GB",
      "byte": "Bytes"
    }
  },
  "install": {
    "title": "Instal Milvus",
    "helm": "Helm Chart",
    "operator": "Operator Milvus",
    "docker": "Docker Compose",
    "adv": "Terlalu banyak sumber daya yang dikonsumsi? Coba Zilliz Cloud (Milvus terkelola) untuk menghemat sumber daya dan mengurangi biaya deployment dan operasi. Periksa lebih banyak detail dengan kalkulator Zilliz Cloud. <0>Pergi ke kalkulator Zilliz Cloud</0>.",
    "adv2": "Mengatur kluster Milvus untuk pengujian kinerja atau penandaan? Rujuk <0>VDB Bench</0> untuk panduan rinci.",
    "tip1": "Bagaimana menjalankan Milvus dengan Docker Compose?",
    "tip2": "Bagaimana menjalankan Milvus dengan Helm Chart?",
    "tip3": "Bagaimana menjalankan Milvus dengan Operator Milvus?"
  },
  "woodpeckerTip": "<0>Woodpecker</0> bertanggung jawab untuk menangani semua tugas streaming. Jumlah sumber daya secara langsung memengaruhi throughput dan latensi Milvus untuk semua operasi streaming, termasuk pencarian data yang terus bertambah, penulisan data, konvensi data dari wal ke binlog (streaming data ke data historis)"
}
