{
  "title": "Herramienta de Dimensionamiento de Milvus",
  "content": "Una herramienta para estimar los requisitos de recursos y generar una configuración para tu implementación de Milvus.",
  "tooltip": "<0>Nota</0>: la configuración es nuestra mejor estimación basada en la experiencia, pero sugerimos probar con tus datos y patrón de tráfico antes de lanzar a producción.",
  "form": {
    "num": "Número de Vectores",
    "dim": "Dimensión del Vector",
    "withScalar": "Con Campos Escalares",
    "averageLength": "Tamaño Promedio de Datos por Fila",
    "offloading": "Descarga de Campos al Disco",
    "mmp": "Milvus usa <0>Mmap</0> para permitir el acceso directo a la memoria de archivos grandes en el disco sin leer los archivos completos en la memoria.",
    "indexType": "Tipo de Índice",
    "indexTypeTip": "¿Cómo elegir el índice de vectores?",
    "indexParam": "Parámetros del Índice",
    "indexParamTip": "¿Cómo establecer los parámetros adecuados del índice? <0>aprende más detalles</0>.",
    "withRawData": "con_datos_crudos",
    "m": "M(Grado máximo del nodo)",
    "nlist": "nlist",
    "maxDegree": "max_degree",
    "segmentSize": "Tamaño del Segmento",
    "dependencyComp": "Componente de Dependencia",
    "mode": "Modo",
    "modeTip": "A medida que crece el tamaño de tus datos, puedes migrar los datos del modo independiente al modo de clúster. <0>Ver Más</0>.",
    "modeDisableTip": "Para grandes tamaños de datos, se recomienda usar la implementación en modo de clúster para lograr un mejor rendimiento y escalabilidad.",
    "pulsar": "Pulsar",
    "kafka": "Kafka",
    "standalone": "Independiente",
    "standaloneDesc": "Adecuado para pequeña a mediana escala.",
    "cluster": "Distribuido",
    "clusterDesc": "Adecuado para gran escala.",
    "segmentTooltip": "datacoord.segment.maxSize es un importante parámetro de configuración de almacenamiento en Milvus. Define el tamaño de un único segmento, que es la unidad física de almacenamiento en Milvus. Aumentar este valor puede mejorar el rendimiento de las consultas, pero también consumirá más recursos. <0>Ver más.</0>"
  },
  "overview": {
    "title": "Requisitos de Recursos",
    "explore": "Explorar el Costo del Servicio Gestionado",
    "overview": "Cálculo del Tamaño de los Datos",
    "raw": "Tamaño de los Datos Crudos: ",
    "rawTooltip": "El tamaño de los datos originales que se determina por el número de vectores, la dimensión del vector y el tamaño de los datos del campo escalar.",
    "memory": "Memoria de Carga: ",
    "memoryTooltip": "Consumo de memoria para nodos de consulta que se determina por el tamaño de los datos crudos, el tipo de índice y los parámetros para nodos de consulta."
  },
  "setup": {
    "title": "Configurar Requisitos de Recursos",
    "cloud": "Explorar el Costo del Servicio Gestionado",
    "outOfRange": "Tienes una gran cantidad de datos. Por favor <0>contáctanos</0> para explorar las mejores prácticas para la implementación.",
    "milvus": {
      "title": "Milvus",
      "proxy": "Proxy",
      "mixCoord": "Mix Coord",
      "dataNode": "Nodo de Datos",
      "indexNode": "Nodo de Índice",
      "queryNode": "Nodo de Consulta",
      "diskSize": "<0>Disco Local</0>: <1>{{size}}</1>",
      "proxyTip": "El proxy es la capa de acceso del sistema y el punto final para los usuarios. Consejo: Asigna más recursos para manejar una carga de trabajo QPS más alta.",
      "mixCoordTip": "Mix coord es responsable de programar tareas en segundo plano del clúster, mantener la topología de metadatos, manejar DDL, DCL y la asignación de TSO.",
      "queryNodeTip": "El nodo de consulta es responsable de la consulta y búsqueda de datos. Consejo: Asigna más recursos para manejar una carga de trabajo intensiva en lectura.",
      "dataNodeTip": "El nodo de datos recupera datos de registro incrementales suscribiéndose al broker de registros, procesa solicitudes de mutación y empaqueta datos de registro en instantáneas de registro y los almacena en el almacenamiento de objetos. Consejo: Asigna más recursos para manejar una carga de trabajo intensiva en escritura.",
      "indexNodeTip": "El nodo de índice es responsable de construir índices. La cantidad de recursos puede afectar la velocidad de construcción del índice. Puedes aumentar o disminuir este recurso según las necesidades reales.",
      "standaloneNode": "Nodo Independiente",
      "streamNode": "Nodo Stream",
      "streamNodeTip": "El StreamingNode es responsable de manejar todas las tareas de streaming. El número de recursos afecta directamente al rendimiento y la latencia de Milvus para todas las operaciones de streaming, incluida la búsqueda de datos crecientes, la escritura de datos, la convención de datos de wal a binlog (datos de streaming a datos históricos)."
    },
    "dependency": {
      "title": "Dependencia",
      "etcd": "ETCD",
      "minio": "Minio",
      "pulsar": "Pulsar",
      "kafka": "Kafka",
      "bookie": "Bookie",
      "broker": "Broker",
      "proxy": "Proxy",
      "zookeeper": "Zookeeper",
      "etcdTip": "ETCD se usa para almacenar metadatos. Por favor, especifica una clase de almacenamiento de alto rendimiento en disco para asegurar un rendimiento óptimo.",
      "apacheTip": "Por favor, especifica una clase de almacenamiento de alto rendimiento en disco para Bookie.Journal y Zookeeper para asegurar un rendimiento óptimo.",
      "kafkaTip": "Por favor, especifica una clase de almacenamiento de alto rendimiento en disco para Zookeeper para asegurar un rendimiento óptimo."
    },
    "basic": {
      "cpuAndMemory": "CPU y Memoria: <0>{{cpu}} {{memory}}</0>",
      "storageWithValue": "Almacenamiento: <0>{{size}}</0>",
      "diskWithValue": "Disco Local: <0>{{disk}}</0>",
      "cpu": "CPU",
      "memory": "Memoria",
      "disk": "Disco Local",
      "storage": "Almacenamiento",
      "podNum": "Número de Pod",
      "pvc": "Pvc por Pod: <0>{{pvc}}</0>",
      "pvcLabel": "Pvc por Pod",
      "journal": "Journal",
      "ledger": "Ledgers",
      "config": "{{cpu}} Core {{memory}} GB",
      "core": "{{cpu}} Core",
      "simpleCore": "{{cpu}} C",
      "gb": "{{memory}} GB",
      "byte": "Bytes"
    }
  },
  "install": {
    "title": "Instalar Milvus",
    "helm": "Helm Chart",
    "operator": "Milvus Operator",
    "docker": "Docker Compose",
    "adv": "¿Demasiados recursos consumidos? Prueba Zilliz Cloud (Milvus gestionado) para ahorrar recursos y reducir los costos de implementación y operación. Consulta más detalles con la calculadora de Zilliz Cloud. <0>Ir a la calculadora de Zilliz Cloud</0>.",
    "adv2": "¿Configurando un clúster de Milvus para pruebas de rendimiento o benchmarking? Consulta <0>VDB Bench</0> para obtener una guía detallada.",
    "tip1": "¿Cómo ejecutar Milvus con Docker Compose?",
    "tip2": "¿Cómo ejecutar Milvus con Helm Chart?",
    "tip3": "¿Cómo ejecutar Milvus con Milvus Operator?"
  },
  "woodpeckerTip": "El <0>Woodpecker</0> es responsable de gestionar todas las tareas de streaming. El número de recursos afecta directamente al rendimiento y la latencia de Milvus para todas las operaciones de streaming, incluida la búsqueda de datos crecientes, la escritura de datos, la convención de datos de wal a binlog (datos de streaming a datos históricos)"
}
