{
  "title": "Milvus Dimensionierungstool",
  "content": "Ein Tool zur Schätzung der Ressourcenanforderungen und Generierung einer Konfiguration für Ihre Milvus-Bereitstellung.",
  "tooltip": "<0>Hinweis</0>: Die Konfiguration ist unsere beste Schätzung basierend auf Erfahrungswerten, aber wir empfehlen, sie mit Ihren Daten und Verkehrsmustern zu testen, bevor Sie sie in die Produktion überführen.",
  "form": {
    "num": "Anzahl der Vektoren",
    "dim": "Vektordimension",
    "withScalar": "Mit skalaren Feldern",
    "averageLength": "Durchschnittliche Datengröße pro Zeile",
    "offloading": "Felder auf die Festplatte auslagern",
    "mmp": "Milvus verwendet <0>Mmap</0>, um direkten Speicherzugriff auf große Dateien auf der Festplatte zu ermöglichen, ohne die gesamten Dateien in den Speicher zu lesen.",
    "indexType": "Indextyp",
    "indexTypeTip": "Wie wählt man den Vektorindex?",
    "indexParam": "Indexparameter",
    "indexParamTip": "Wie setzt man geeignete Indexparameter? <0>Erfahren Sie mehr Details</0>.",
    "withRawData": "mit_rohdaten",
    "m": "M (Maximaler Grad des Knotens)",
    "nlist": "nlist",
    "maxDegree": "max_degree",
    "segmentSize": "Segmentgröße",
    "dependencyComp": "Abhängigkeitskomponente",
    "mode": "Modus",
    "modeTip": "Wenn Ihre Datenmenge wächst, können Sie Daten vom Standalone-Modus in den Cluster-Modus migrieren. <0>Mehr anzeigen</0>.",
    "modeDisableTip": "Für große Datenmengen wird empfohlen, die Cluster-Modus-Bereitstellung zu verwenden, um eine bessere Leistung und Skalierbarkeit zu erreichen.",
    "pulsar": "Pulsar",
    "kafka": "Kafka",
    "standalone": "Standalone",
    "standaloneDesc": "Geeignet für kleine bis mittlere Umgebungen.",
    "cluster": "Verteilt",
    "clusterDesc": "Geeignet für große Umgebungen.",
    "segmentTooltip": "datacoord.segment.maxSize ist ein wichtiger Speicherkonfigurationsparameter in Milvus. Er definiert die Größe eines einzelnen Segments, das die physische Speichereinheit in Milvus darstellt. Eine Erhöhung dieses Wertes kann die Abfrageleistung verbessern, verbraucht aber auch mehr Ressourcen. <0>Mehr sehen.</0>"
  },
  "overview": {
    "title": "Ressourcenanforderungen",
    "explore": "Verwaltete Dienstkosten erkunden",
    "overview": "Datenvolumenberechnung",
    "raw": "Rohdatengröße: ",
    "rawTooltip": "Die Größe der Originaldaten, die durch die Anzahl der Vektoren, die Vektordimension und die Größe der skalaren Felder bestimmt wird.",
    "memory": "Ladespeicher: ",
    "memoryTooltip": "Speicherverbrauch für Abfrageknoten, der durch die Rohdatengröße, den Indextyp und die Parameter für Abfrageknoten bestimmt wird."
  },
  "setup": {
    "title": "Ressourcenanforderungen einrichten",
    "cloud": "Verwaltete Dienstkosten erkunden",
    "outOfRange": "Sie haben eine große Datenmenge. Bitte <0>kontaktieren Sie uns</0>, um die besten Praktiken für die Bereitstellung zu erkunden.",
    "milvus": {
      "title": "Milvus",
      "proxy": "Proxy",
      "mixCoord": "Mix Coord",
      "dataNode": "Datenknoten",
      "indexNode": "Indexknoten",
      "queryNode": "Abfrageknoten",
      "diskSize": "<0>Lokale Festplatte</0>: <1>{{size}}</1>",
      "proxyTip": "Proxy ist die Zugriffsschicht des Systems und der Endpunkt für Benutzer. Tipps: Weisen Sie mehr Ressourcen zu, um eine höhere QPS-Arbeitslast zu bewältigen.",
      "mixCoordTip": "Mix Coord ist für die Planung von Cluster-Hintergrundaufgaben, die Aufrechterhaltung der Metadaten-Topologie, die Handhabung von DDL, DCL und TSO-Zuweisung verantwortlich.",
      "queryNodeTip": "Abfrageknoten ist für Datenabfragen und -suchen verantwortlich. Tipps: Weisen Sie mehr Ressourcen zu, um leseintensive Arbeitslasten zu bewältigen.",
      "dataNodeTip": "Datenknoten ruft inkrementelle Protokolldaten ab, indem er den Log-Broker abonniert, verarbeitet Mutationsanfragen und packt Protokolldaten in Protokoll-Snapshots und speichert sie im Objektspeicher. Tipps: Weisen Sie mehr Ressourcen zu, um schreibintensive Arbeitslasten zu bewältigen.",
      "indexNodeTip": "Indexknoten ist für den Aufbau von Indizes verantwortlich. Die Menge der Ressourcen kann die Geschwindigkeit des Indexaufbaus beeinflussen. Sie können diese Ressource je nach Bedarf erhöhen oder verringern.",
      "standaloneNode": "Standalone-Knoten",
      "streamNode": "Stream-Knoten",
      "streamNodeTip": "Der StreamingNode ist für die Abwicklung aller Streaming-Aufgaben zuständig. Die Anzahl der Ressourcen wirkt sich direkt auf den Durchsatz und die Latenz von Milvus für alle Streaming-Operationen aus, einschließlich der Suche nach wachsenden Daten, dem Schreiben von Daten und der Konvention von wal zu binlog (Streaming-Daten zu historischen Daten)."
    },
    "dependency": {
      "title": "Abhängigkeit",
      "etcd": "ETCD",
      "minio": "Minio",
      "pulsar": "Pulsar",
      "kafka": "Kafka",
      "bookie": "Bookie",
      "broker": "Broker",
      "proxy": "Proxy",
      "zookeeper": "Zookeeper",
      "etcdTip": "ETCD wird zur Speicherung von Metadaten verwendet. Bitte geben Sie eine Speicherklasse mit hoher Festplattenleistung an, um eine optimale Leistung zu gewährleisten.",
      "apacheTip": "Bitte geben Sie eine Speicherklasse mit hoher Festplattenleistung für Bookie.Journal und Zookeeper an, um eine optimale Leistung zu gewährleisten.",
      "kafkaTip": "Bitte geben Sie eine Speicherklasse mit hoher Festplattenleistung für Zookeeper an, um eine optimale Leistung zu gewährleisten."
    },
    "basic": {
      "cpuAndMemory": "CPU und Speicher: <0>{{cpu}} {{memory}}</0>",
      "storageWithValue": "Speicher: <0>{{size}}</0>",
      "diskWithValue": "Lokale Festplatte: <0>{{disk}}</0>",
      "cpu": "CPU",
      "memory": "Speicher",
      "disk": "Lokale Festplatte",
      "storage": "Speicher",
      "podNum": "Pod-Anzahl",
      "pvc": "Pvc pro Pod: <0>{{pvc}}</0>",
      "pvcLabel": "Pvc pro Pod",
      "journal": "Journal",
      "ledger": "Ledger",
      "config": "{{cpu}} Core {{memory}} GB",
      "core": "{{cpu}} Core",
      "simpleCore": "{{cpu}} C",
      "gb": "{{memory}} GB",
      "byte": "Bytes"
    }
  },
  "install": {
    "title": "Milvus installieren",
    "helm": "Helm Chart",
    "operator": "Milvus Operator",
    "docker": "Docker Compose",
    "adv": "Zu viele Ressourcen verbraucht? Probieren Sie Zilliz Cloud (verwaltetes Milvus), um Ressourcen zu sparen und Bereitstellungs- und Betriebskosten zu senken. Erfahren Sie mehr Details mit dem Zilliz Cloud-Rechner. <0>Zum Zilliz Cloud-Rechner</0>.",
    "adv2": "Richten Sie einen Milvus-Cluster für Leistungstests oder Benchmarks ein? Weitere Anleitungen finden Sie unter <0>VDB Bench</0>.",
    "tip1": "Wie führt man Milvus mit Docker Compose aus?",
    "tip2": "Wie führt man Milvus mit Helm Chart aus?",
    "tip3": "Wie führt man Milvus mit Milvus Operator aus?"
  },
  "woodpeckerTip": "Der <0>Woodpecker</0> ist für die Abwicklung aller Streaming-Aufgaben zuständig. Die Anzahl der Ressourcen wirkt sich direkt auf den Durchsatz und die Latenz von Milvus für alle Streaming-Operationen aus, einschließlich der Suche nach wachsenden Daten, des Schreibens von Daten, der Datenkonvention von wal zu binlog (Streaming-Daten zu historischen Daten)"
}
