{
  "title": "Инструмент оценки Milvus",
  "content": "Инструмент для оценки требований к ресурсам и генерации конфигурации для вашего развертывания Milvus.",
  "tooltip": "<0>Примечание</0>: конфигурация является нашей лучшей оценкой на основе опыта, но мы рекомендуем протестировать с вашими данными и шаблоном трафика перед запуском в продакшн.",
  "form": {
    "num": "Количество векторов",
    "dim": "Размерность вектора",
    "withScalar": "С скалярными полями",
    "averageLength": "Средний размер данных на строку",
    "offloading": "Выгрузка полей на диск",
    "mmp": "Milvus использует <0>Mmap</0> для обеспечения прямого доступа к памяти к большим файлам на диске без чтения всех файлов в память.",
    "indexType": "Тип индекса",
    "indexTypeTip": "Как выбрать векторный индекс?",
    "indexParam": "Параметры индекса",
    "indexParamTip": "Как установить правильные параметры индекса? <0>узнать больше</0>.",
    "withRawData": "with_raw_data",
    "m": "M(Максимальная степень узла)",
    "nlist": "nlist",
    "maxDegree": "max_degree",
    "segmentSize": "Размер сегмента",
    "dependencyComp": "Компонент зависимости",
    "mode": "Режим",
    "modeTip": "По мере роста объема данных вы можете мигрировать данные из автономного режима в кластерный режим. <0>Узнать больше</0>.",
    "modeDisableTip": "Для больших объемов данных рекомендуется использовать развертывание в кластерном режиме для достижения лучшей производительности и масштабируемости.",
    "pulsar": "Pulsar",
    "kafka": "Kafka",
    "standalone": "Автономный",
    "standaloneDesc": "Подходит для небольших и средних масштабов.",
    "cluster": "Распределенный",
    "clusterDesc": "Подходит для больших масштабов.",
    "segmentTooltip": "datacoord.segment.maxSize - это важный параметр конфигурации хранилища в Milvus. Он определяет размер одного сегмента, который является физической единицей хранения в Milvus. Увеличение этого значения может повысить производительность запросов, но при этом будет потребляться больше ресурсов. <0>Подробнее.</0>",
    "refine": "Уточнить",
    "refineType": "Уточнить тип"
  },
  "overview": {
    "title": "Требования к ресурсам",
    "explore": "Исследуйте стоимость управляемой службы",
    "overview": "Расчет размера данных",
    "raw": "Размер исходных данных: ",
    "rawTooltip": "Размер исходных данных, определяемый количеством векторов, размерностью вектора и размером данных скалярного поля.",
    "memory": "Загрузочная память: ",
    "memoryTooltip": "Потребление памяти для узлов запросов, которое определяется размером исходных данных, типом индекса и параметрами для узлов запросов."
  },
  "setup": {
    "title": "Настройка требований к ресурсам",
    "cloud": "Исследуйте стоимость управляемой службы",
    "outOfRange": "У вас большой объем данных. Пожалуйста, <0>свяжитесь с нами</0>, чтобы исследовать лучшие практики для развертывания.",
    "milvus": {
      "title": "Milvus",
      "proxy": "Прокси",
      "mixCoord": "Mix Coord",
      "dataNode": "Узел данных",
      "indexNode": "Узел индекса",
      "queryNode": "Узел запроса",
      "diskSize": "<0>Локальный диск</0>: <1>{{size}}</1>",
      "proxyTip": "Прокси является уровнем доступа системы и конечной точкой для пользователей. Совет: выделите больше ресурсов для обработки более высокой нагрузки QPS.",
      "mixCoordTip": "Mix coord отвечает за планирование фоновых задач кластера, поддержание топологии метаданных, обработку DDL, DCL и распределение TSO.",
      "queryNodeTip": "Узел запроса отвечает за запрос данных и поиск. Совет: выделите больше ресурсов для обработки нагрузки с преобладанием чтения.",
      "dataNodeTip": "Узел данных извлекает инкрементальные данные журнала, подписываясь на брокер журнала, обрабатывает запросы на мутацию и упаковывает данные журнала в снимки журнала и хранит их в объектном хранилище. Совет: выделите больше ресурсов для обработки нагрузки с преобладанием записи.",
      "indexNodeTip": "Узел индекса отвечает за построение индексов. Количество ресурсов может повлиять на скорость построения индексов. Вы можете увеличить или уменьшить этот ресурс в зависимости от фактических потребностей.",
      "standaloneNode": "Автономный узел",
      "streamNode": "Узел потока",
      "streamNodeTip": "StreamingNode отвечает за обработку всех потоковых задач. Количество ресурсов напрямую влияет на пропускную способность и задержку Milvus для всех потоковых операций, включая поиск растущих данных, запись данных, преобразование данных из wal в binlog (потоковых данных в исторические данные)."
    },
    "dependency": {
      "title": "Зависимость",
      "etcd": "ETCD",
      "minio": "Minio",
      "pulsar": "Pulsar",
      "kafka": "Kafka",
      "bookie": "Bookie",
      "broker": "Broker",
      "proxy": "Proxy",
      "zookeeper": "Zookeeper",
      "etcdTip": "ETCD используется для хранения метаданных. Пожалуйста, укажите класс хранения с высокой производительностью диска, чтобы обеспечить оптимальную производительность.",
      "apacheTip": "Пожалуйста, укажите класс хранения с высокой производительностью диска для Bookie.Journal и Zookeeper, чтобы обеспечить оптимальную производительность.",
      "kafkaTip": "Пожалуйста, укажите класс хранения с высокой производительностью диска для Zookeeper, чтобы обеспечить оптимальную производительность."
    },
    "basic": {
      "cpuAndMemory": "CPU и память: <0>{{cpu}} {{memory}}</0>",
      "storageWithValue": "Хранилище: <0>{{size}}</0>",
      "diskWithValue": "Локальный диск: <0>{{disk}}</0>",
      "cpu": "CPU",
      "memory": "Память",
      "disk": "Локальный диск",
      "storage": "Хранилище",
      "podNum": "Количество под",
      "pvc": "Pvc на под: <0>{{pvc}}</0>",
      "pvcLabel": "Pvc на под",
      "journal": "Журнал",
      "ledger": "Ледгеры",
      "config": "{{cpu}} Core {{memory}} GB",
      "core": "{{cpu}} Core",
      "simpleCore": "{{cpu}} C",
      "gb": "{{memory}} GB",
      "byte": "Байты"
    }
  },
  "install": {
    "title": "Установить Milvus",
    "helm": "Helm Chart",
    "operator": "Milvus Operator",
    "docker": "Docker Compose",
    "adv": "Слишком много потребляемых ресурсов? Попробуйте Zilliz Cloud (управляемый Milvus), чтобы сэкономить ресурсы и сократить затраты на развертывание и эксплуатацию. Узнайте больше с помощью калькулятора Zilliz Cloud. <0>Перейти к калькулятору Zilliz Cloud</0>.",
    "adv2": "Настраиваете кластер Milvus для тестирования производительности или бенчмаркинга? Обратитесь к <0>VDB Bench</0> для подробной инструкции.",
    "tip1": "Как запустить Milvus с Docker Compose?",
    "tip2": "Как запустить Milvus с Helm Chart?",
    "tip3": "Как запустить Milvus с Milvus Operator?"
  },
  "woodpeckerTip": "<0>Woodpecker</0> - это облачная нативная система журналов с опережающей записью (WAL), появившаяся в Milvus 2.6.0. Она призвана заменить Kafka и Pulsar в качестве MQ в Milvus, чтобы упростить операции, максимизировать пропускную способность и легко масштабироваться. На данный момент она работает встроенной в узлы потоковой передачи данных.",
  "previousVersion": "Предыдущая версия инструмента для определения размеров находится <0>здесь.</0>",
  "titleV250": "Milvus Sizing Tool для Milvus v2.5.x"
}
