{
  "title": "Ferramenta de Dimensionamento do Milvus",
  "content": "Uma ferramenta para estimar os requisitos de recursos e gerar uma configuração para sua implantação do Milvus.",
  "tooltip": "<0>Nota</0>: a configuração é nossa melhor estimativa com base na experiência, mas sugerimos que você teste com seus dados e padrão de tráfego antes de lançar para produção.",
  "form": {
    "num": "Número de Vetores",
    "dim": "Dimensão do Vetor",
    "withScalar": "Com Campos Escalares",
    "averageLength": "Tamanho Médio dos Dados por Linha",
    "offloading": "Transferência de Campos para Disco",
    "mmp": "O Milvus usa <0>Mmap</0> para permitir acesso direto à memória a arquivos grandes no disco sem ler os arquivos inteiramente na memória.",
    "indexType": "Tipo de Índice",
    "indexTypeTip": "Como escolher o índice vetorial?",
    "indexParam": "Parâmetros do Índice",
    "indexParamTip": "Como definir parâmetros adequados para o índice? <0>Saiba mais detalhes</0>.",
    "withRawData": "com_dados_brutos",
    "m": "M (Grau máximo do nó)",
    "nlist": "nlist",
    "maxDegree": "grau_máximo",
    "segmentSize": "Tamanho do Segmento",
    "dependencyComp": "Componente de Dependência",
    "mode": "Modo",
    "modeTip": "À medida que o tamanho dos seus dados cresce, você pode migrar dados do modo Standalone para o modo Cluster. <0>Veja Mais</0>.",
    "modeDisableTip": "Para grandes volumes de dados, é recomendado usar o modo de implantação em cluster para obter melhor desempenho e escalabilidade.",
    "pulsar": "Pulsar",
    "kafka": "Kafka",
    "standalone": "Standalone",
    "standaloneDesc": "Adequado para pequeno e médio porte.",
    "cluster": "Distribuído",
    "clusterDesc": "Adequado para grande porte.",
    "segmentTooltip": "datacoord.segment.maxSize é um importante parâmetro de configuração de armazenamento em Milvus. Ele define o tamanho de um único segmento, que é a unidade de armazenamento físico em Milvus. Aumentar esse valor pode melhorar o desempenho da consulta, mas também consumirá mais recursos. <0>Veja mais.</0>",
    "refine": "Refinar",
    "refineType": "Refinar tipo"
  },
  "overview": {
    "title": "Requisitos de Recursos",
    "explore": "Explorar Custo do Serviço Gerenciado",
    "overview": "Cálculo do Tamanho dos Dados",
    "raw": "Tamanho dos Dados Brutos: ",
    "rawTooltip": "O tamanho dos dados brutos é determinado pelo número de vetores, dimensão do vetor e tamanho dos dados dos campos escalares.",
    "memory": "Memória de Carregamento: ",
    "memoryTooltip": "Consumo de memória dos nós de consulta, determinado pelo tamanho dos dados brutos, tipo de índice e parâmetros dos nós de consulta."
  },
  "setup": {
    "title": "Requisitos de Recursos de Configuração",
    "cloud": "Explorar Custo do Serviço Gerenciado",
    "outOfRange": "Você possui uma grande quantidade de dados. Por favor, <0>entre em contato conosco</0> para explorar as melhores práticas de implantação.",
    "milvus": {
      "title": "Milvus",
      "proxy": "Proxy",
      "mixCoord": "Coordenador Misto",
      "dataNode": "Nó de Dados",
      "indexNode": "Nó de Índice",
      "queryNode": "Nó de Consulta",
      "diskSize": "<0>Disco Local</0>: <1>{{size}}</1>",
      "proxyTip": "O proxy é a camada de acesso do sistema e ponto de extremidade para os usuários. Dica: Aloque mais recursos para lidar com cargas de trabalho de alta QPS.",
      "mixCoordTip": "O coordenador misto é responsável por agendar tarefas de fundo do cluster, manter a topologia de metadados, lidar com DDL, DCL e alocação de TSO.",
      "queryNodeTip": "O nó de consulta é responsável por consultas e pesquisas de dados. Dica: Aloque mais recursos para lidar com cargas de trabalho de leitura intensiva.",
      "dataNodeTip": "O nó de dados recupera dados de log incremental por meio de subscrição ao corretor de logs, processa solicitações de mutação e empacota dados de log em instantâneos de log, armazenando-os no armazenamento de objetos. Dica: Aloque mais recursos para lidar com cargas de trabalho de escrita intensiva.",
      "indexNodeTip": "O nó de índice é responsável por criar índices. A quantidade de recursos pode afetar a velocidade de criação de índices. Você pode aumentar ou diminuir este recurso de acordo com as necessidades reais.",
      "standaloneNode": "Nó Standalone",
      "streamNode": "Nó de fluxo",
      "streamNodeTip": "O StreamingNode é responsável por gerir todas as tarefas de streaming. O número de recursos afecta diretamente o débito e a latência do Milvus para todas as operações de streaming, incluindo a pesquisa de dados crescentes, a escrita de dados, a convenção de dados de wal para binlog (dados de streaming para dados históricos)."
    },
    "dependency": {
      "title": "Dependência",
      "etcd": "ETCD",
      "minio": "Minio",
      "pulsar": "Pulsar",
      "kafka": "Kafka",
      "bookie": "Bookie",
      "broker": "Broker",
      "proxy": "Proxy",
      "zookeeper": "Zookeeper",
      "etcdTip": "O ETCD é usado para armazenar metadados. Por favor, especifique uma classe de armazenamento de alto desempenho em disco para garantir o melhor desempenho.",
      "apacheTip": "Por favor, especifique uma classe de armazenamento de alto desempenho em disco para Bookie.Journal e Zookeeper para garantir o melhor desempenho.",
      "kafkaTip": "Por favor, especifique uma classe de armazenamento de alto desempenho em disco para Zookeeper para garantir o melhor desempenho."
    },
    "basic": {
      "cpuAndMemory": "CPU e Memória: <0>{{cpu}} {{memory}}</0>",
      "storageWithValue": "Armazenamento: <0>{{size}}</0>",
      "diskWithValue": "Disco Local: <0>{{disk}}</0>",
      "cpu": "CPU",
      "memory": "Memória",
      "disk": "Disco Local",
      "storage": "Armazenamento",
      "podNum": "Número de Pods",
      "pvc": "Pvc por Pod: <0>{{pvc}}</0>",
      "pvcLabel": "Pvc por Pod",
      "journal": "Journal",
      "ledger": "Ledgers",
      "config": "{{cpu}} Core {{memory}} GB",
      "core": "{{cpu}} Core",
      "simpleCore": "{{cpu}} C",
      "gb": "{{memory}} GB",
      "byte": "Bytes"
    }
  },
  "install": {
    "title": "Instalar Milvus",
    "helm": "Helm Chart",
    "operator": "Operador do Milvus",
    "docker": "Docker Compose",
    "adv": "Muitos recursos consumidos? Experimente o Zilliz Cloud (Milvus gerenciado) para economizar recursos e reduzir custos de implantação e operação. Saiba mais detalhes com a calculadora do Zilliz Cloud. <0>Ir para a calculadora do Zilliz Cloud</0>.",
    "adv2": "Configurando um cluster do Milvus para testes de desempenho ou benchmarking? Consulte o <0>VDB Bench</0> para orientações detalhadas.",
    "tip1": "Como executar o Milvus com Docker Compose?",
    "tip2": "Como executar o Milvus com Helm Chart?",
    "tip3": "Como executar o Milvus com Operador do Milvus?"
  },
  "woodpeckerTip": "<0>O Woodpecker</0> é um sistema de registo de escrita antecipada (WAL) nativo da nuvem desde o Milvus 2.6.0. Ele foi projetado para substituir o Kafka e o Pulsar como MQ no Milvus para simplificar as operações, maximizar a taxa de transferência e escalar sem esforço. Por enquanto, ele está sendo executado incorporado nos nós de streaming.",
  "previousVersion": "A versão anterior da ferramenta de dimensionamento está <0>aqui</0>."
}
